In [17]:
import os
import pandas as pd
import numpy as np

## <b> 1. Explore data </b>
Analyze the data provided and check what kind of features do we have available

In [18]:
data = r"data"
calendar = os.path.join(data, "calendar.csv")
listings = os.path.join(data, "listings.csv")
reviews = os.path.join(data, "reviews.csv")

caldf = pd.read_csv(calendar)
listdf = pd.read_csv(listings)
revdf = pd.read_csv(reviews)

c:\users\manuelmartin\appdata\local\programs\python\python36\lib\site-packages\IPython\core\interactiveshell.py:3020: DtypeWarning: Columns (43,61,62) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

##### Description of each source file
All files have been compiled on 8th of March, 2019
- calendar.csv: Detailed calendar data for listings in Madrid
- listings.csv: Detailed listings data for Madrid
- reviews.csv: Detailed review data for listings in Madrid

In [19]:
caldf.head(5)

,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
0,6369,2019-03-08,f,$50.00,$50.00,3,30
1,283862,2019-03-08,f,$150.00,$150.00,1,1125
2,283862,2019-03-09,f,$85.00,$85.00,1,1125
3,283862,2019-03-10,f,$70.00,$70.00,1,1125
4,283862,2019-03-11,t,$50.00,$50.00,1,1125

In [20]:
caldf.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6444440 entries, 0 to 6444439
Data columns (total 7 columns):
listing_id        int64
date              object
available         object
price             object
adjusted_price    object
minimum_nights    int64
maximum_nights    int64
dtypes: int64(3), object(4)
memory usage: 344.2+ MB

In [21]:
revdf.head(3)

,listing_id,id,date,reviewer_id,reviewer_name,comments
0,6369,29428,2010-03-14,84790,Nancy,Simon and Arturo have the ultimate location in...
1,6369,31018,2010-03-23,84338,David,Myself and Kristy originally planned on stayin...
2,6369,34694,2010-04-10,98655,Marion,We had a great time at Arturo and Simon's ! A ...